# Built In Failures Sub Region Failures Class

Source: https://www.revitapidocs.com/2026/da08085c-3c91-d0cc-0b94-117b82fa132c.htm

---

| Built In Failures Sub Region Failures Class |
| --- |

Inheritance Hierarchy System Object
Autodesk.Revit.DB BuiltInFailures SubRegionFailures

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class SubRegionFailures
```

```
Public NotInheritable Class SubRegionFailures
```

```
public ref class SubRegionFailures abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SubRegionFailures = class end
```
The BuiltInFailures SubRegionFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CreateSubRegionFailed | Create sub\-division failed. |
|  | NoHostForToposolidSubregion | This sub\-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option. |
|  | SubDivisionOffsetInvalid | Sub\-division's offset must be less than the thickness of its type. |
|  | SubDivisionPhaseMismatch | Sub\-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub\-division phase will be set to match the Toposolid. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace